
public class Ex7 {

	public static void main(String[] args) {
		/*
		 * Имате предварително въведени стойности от естествени числа, въведени
		 * в квадратна таблица с размери 6 реда и 6 колони. Да се състави
		 * програма , чрез която се намира сумата на всички елементи, чиято сума
		 * на индекси за ред и колона е четно число. Програмата да извежда
		 * формираните суми за всеки отделен ред на квадратната таблица, както и
		 * общата сума от тези елементи. Да се използва само един цикъл.
		 * Пример:
		 * 11,12,13,14,15,16,
		 * 21,22,23,24,25,26,
		 * 31,32,33,34,35,36,
		 * 41,42,43,44,45,46,
		 * 51,52,53,54,55,56,
		 * 61,62,63,64,65,66
		 * Изход:
		 * 11, ,13, ,15, , сума от елементите за реда: 39
		 * 22, ,24, ,26, сума от елементите за реда: 72
		 * 31, ,33, ,35, , сума от елементите за реда: 99
		 * 42, ,44, ,46, сума от елементите за реда: 132
		 * 51, ,53, ,55, , сума от елементите за реда: 159
		 * 62, ,64, ,66 сума от елементите за реда: 192
		 * Сума на елементите: 693
		 */
		
		int sum = 0;
		int totalSum = 0;
		int row = 0;
		
		int[][] arr = {
				{1,2,3,9,5,1},
				{6,9,3,4,5,5},
				{1,2,3,2,5,6},
				{3,2,3,7,5,7},
				{1,2,8,4,5,6},
				{1,0,3,4,5,4},
		};
		
		while(row < arr.length) {
			sum = 0;

			for (int col = 1; col < arr[row].length; col+=2) {
				
				sum += arr[row][col];
				totalSum += sum;

				if (col == 1) {
					System.out.print("[" + arr[row][col]);
				} else if (col == arr[row].length - 1) {
						System.out.println(", " + arr[row][col] + "] the sum of the elements on this row is : " + sum );
				} else {
					System.out.print(", " + arr[row][col]);
				}
			}
			row++;
		}
		System.out.println("The sum of all of these elements is : " + totalSum);

	}

}
