
public class Ex16 {

	public static void main(String[] args) {
		/*
		 * Да се състави програма, чрез която предварително въведени 10 реални
		 * числа от интервала се обработват по следния начин: 
		 * 1. Извежда съществуващите числа. 
		 * 2. Всички елементи със стойност по-малки
		 * от-0.231 се заменят съссумата от квадрата на поредния им номер +
		 * числото 41.25, а всички останали елементи се заменят с произведението
		 * между самия елемент и неговият пореден номер. Поредният номер на
		 * първият елемент е 1. 
		 * 3. Да се изведат елементите от началния и новообразувания масив. 
		 * Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, -7.5,8.6, 9.1, -4 
		 * Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8,81.9,141.25
		 */
		/*
		 * Има условие,че въведените числа трчбва да са в даден интервал, но
		 * самият интервал не е посочен, така че няма да им слагам различен
		 * интервал от този на посочения тип променлива.
		 */

		double[] arr = { -2.32, -1.43, -0.123, 2.32, 5.12, -0.232, 1.22, 3.41, 4, -3 };
		double[] arr2 = new double[10];

		for (int i = 0, j = 0; i < arr.length && j < arr2.length; i++, j++) {
			if (arr[i] <= (-0.232)) {
				arr2[j] = ((i + 1) * (i + 1)) + 41.25;
			} else {
				arr2[j] = arr[i] * (i + 1);
			}
		}
		System.out.println("The elements in the original array are :");
		for (int i = 0; i < arr.length; i++) {
			if (i == 0) {
				System.out.print("[" + arr[i] + ", ");
			} else if (i == arr.length - 1) {
				System.out.println(arr[i] + "]");
				break;
			} else {
				System.out.print(arr[i] + ", ");
			}
		}

		System.out.println("The elements in the new array are :");

		for (int i = 0; i < arr2.length; i++) {
			if (i == 0) {
				System.out.print("[" + arr2[i] + ", ");
			} else if (i == arr2.length - 1) {
				System.out.println(arr2[i] + "]");
				break;
			} else {
				System.out.print(arr2[i] + ", ");
			}
		}
	}

}
